gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/source/freertos_event.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"
#include "event_groups.h"
#include "semphr.h"
#include "fsl_pint.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "app.h"
#include "pmic_support.h"
#include "pmic_pca9422.h"
#include "glf70583.h"
#include "aw933xx.h"
#include "aw93305.h"
#include "bq256xx_charger.h"
#include "glf70302.h"
#include "ktd202x_leds.h"
#include "aw88166.h"

#include "spi_handler.h"

#include <string.h>
#include <stdlib.h>

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define USE_EVENT 1
#define USE_SEMAPHORE 0

#define SCAN_I2C_ADDRESS_ENABLE 1


/* event bits */
#define BTN_NOTIFY_EDGE   (1UL << 0)  // 在sButtonTaskHandle，來自 FunKey PINT ISR 的雙邊緣事件，
#define BTN_NOTIFY_DBL    (1UL << 1)  // 在sButtonTaskHandle，雙擊計時器到時，
#define PWR_NOTIFY_EDGE   (1UL << 0)  // 在sPowerKeyTaskHandle，來自 PowerKey PINT ISR 的邊緣事件

/* === 按鍵行為參數 === */
#define BTN_ACTIVE_LEVEL          0   // active-low: 按下=0，放開=1；若相反改為 1
#define BTN_DEBOUNCE_MS          30
#define BTN_LONG_MS            1000
#define BTN_DBLCLICK_GAP_MS     300
#define PWR_ACTIVE_LEVEL          0      // active-low: 按下=0；若為 active-high 改為 1
#define PWR_DEBOUNCE_MS          30      // 軟體去抖
#define PWR_LONG_MS            3000      // 長按 3 秒（放開才判斷）
#define PWR_MIN_SHORT_MS         50      // 太短的抖動/誤觸（<50ms）不算短按
#define POWER_KEY_PINT_CH  		  0   // PINT 通道
#define FUN_KEY1_PINT_CH  		  1   // PINT 通道
/* === 按鈕任務的 handle 與軟體定時器 === */
static TaskHandle_t   sButtonTaskHandle = NULL;
static TimerHandle_t  sBtnDblTimer  = NULL;
static TaskHandle_t sPowerKeyTaskHandle = NULL;

/*****************************************************************************************************/
/* ===== I2C EventGroup bits (for unified I2C_Task) ===== */
#define TOUCH_EVENT_BIT      (1UL << 0)
#define CHARGER_EVENT_BIT    (1UL << 1)
#define GAUGE_EVENT_BIT      (1UL << 2)

BatteryInfo battery;
/* ===== I2C synchronization objects ===== */
static EventGroupHandle_t i2c_event_group = NULL;
static SemaphoreHandle_t  i2c_mutex       = NULL;
static TaskHandle_t       sI2CTaskHandle  = NULL;

/* ===== I2C task prototype & external device handlers ===== */
static void I2C_Task(void *pvParameters);

extern volatile struct aw933xx_dev aw933xx;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void button_task(void *pvParameters);

/* ===== external SPI handlers ===== */
extern QueueHandle_t spi_request_queue ;
extern EventGroupHandle_t spi_event_group ;
extern SemaphoreHandle_t spi_semaphore ;

/*******************************************************************************
 * Code
 ******************************************************************************/
/* 讀腳位 */
static inline uint8_t pwr_raw_read(void)
{
    return (uint8_t)GPIO_PinRead(GPIO, POWER_KEY_PORT, POWER_KEY_PIN);
}

/* 讀腳位 */
static inline uint8_t btn_raw_read(void)
{
    return (uint8_t)GPIO_PinRead(GPIO, FUN_KEY1_N_PORT, FUN_KEY1_N_PIN);
}

/* 雙擊計時器回呼：只通知任務 */
static void vBtnDblTimerCb(TimerHandle_t xTimer)
{
    if (sButtonTaskHandle) {
        (void)xTaskNotify(sButtonTaskHandle, BTN_NOTIFY_DBL, eSetBits);
    }
}

/**
 * @brief 按鈕處理任務 (生產者)。
 * @details 此任務持續監控一個 GPIO 按鈕的狀態，並能區分短按和長按。
 * 當檢測到有效的按鍵事件時，它會將對應的十六進制值 (SHORT_PRESS_HEX_VALUE 或 LONG_PRESS_HEX_VALUE)
 * 作為一個請求發送到 `spi_request_queue` 消息佇列中，以觸發 SPI 傳輸。
 */
static void button_task(void *pvParameters)
{
	   const TickType_t debounceTicks   = pdMS_TO_TICKS(BTN_DEBOUNCE_MS);
	   const TickType_t longTicks       = pdMS_TO_TICKS(BTN_LONG_MS);

	    sButtonTaskHandle = xTaskGetCurrentTaskHandle();

	    /* 只需要「雙擊」單次定時器 */
	    sBtnDblTimer  = xTimerCreate("btn_dbl", pdMS_TO_TICKS(BTN_DBLCLICK_GAP_MS),
	                                 pdFALSE, NULL, vBtnDblTimerCb);
	    configASSERT(sBtnDblTimer);

	    /* 初始狀態 */
	    uint8_t stable_level = btn_raw_read();
	    bool    is_pressed   = (stable_level == BTN_ACTIVE_LEVEL);
	    bool    dbl_pending  = false;            // 是否正在等待第二次短按
	    TickType_t press_start_tick = 0;

	    if (is_pressed) {
	        // 上電時剛好按住：當作剛按下
	        press_start_tick = xTaskGetTickCount();
	    }

	    for (;;)
	    {
	        uint32_t notifyBits = 0;
	        (void)xTaskNotifyWait(0, 0xFFFFFFFFu, &notifyBits, portMAX_DELAY);

	        /* A) 雙擊窗口到期：若仍在等待第二下且目前沒有按住 → 單擊成立 */
	        if (notifyBits & BTN_NOTIFY_DBL) {
	            if (dbl_pending && !is_pressed) {
	                dbl_pending = false;
	                PRINTF("[Button] Short Press detected.\r\n");
	                PRINTF("[Button] Short Press detected. Sending 0x%02X\r\n", SHORT_PRESS_HEX_VALUE);
	                uint8_t v = SHORT_PRESS_HEX_VALUE;
	                (void)xQueueSend(spi_request_queue, &v, 0);
	            }
	            // 若此時已經在第二次按壓中（is_pressed==true），不回報短按，
	            // 等放開時再判斷是雙擊或長按（第二次按壓可能超過 1 秒而成為長按）
	        }

	        /* B) 來自 PINT 的邊緣事件：去抖後判斷按下/放開 */
	        if (notifyBits & BTN_NOTIFY_EDGE) {
	            uint8_t l1 = btn_raw_read();
	            vTaskDelay(debounceTicks);
	            uint8_t l2 = btn_raw_read();
	            uint8_t new_level = l2;

	            if (new_level != stable_level) {
	                stable_level = new_level;
	                bool now_pressed = (stable_level == BTN_ACTIVE_LEVEL);
	                TickType_t now = xTaskGetTickCount();

	                if (now_pressed && !is_pressed) {
	                    /* 放開 -> 按下：記錄開始時間 */
	                    is_pressed = true;
	                    press_start_tick = now;
	                    // 不動 dbl_pending，讓第二次按壓可以覆蓋成「雙擊或長按」
	                }
	                else if (!now_pressed && is_pressed) {
	                    /* 按下 -> 放開：在此刻才判定長按/短按/雙擊 */
	                    is_pressed = false;
	                    TickType_t press_dur = now - press_start_tick;

	                    if (press_dur >= longTicks) {
	                        /* 長按（放開才觸發）→ 最高優先權 */
	                        PRINTF("[Button] Long Press (on-release) detected. \r\n");
	                        PRINTF("[Button] Long Press (on-release) detected. Sending 0x%02X\r\n",
	                               LONG_PRESS_HEX_VALUE);
	                        uint8_t v = LONG_PRESS_HEX_VALUE;
	                        (void)xQueueSend(spi_request_queue, &v, 0);

	                        /* 任何待定的單擊作廢 */
	                        dbl_pending = false;
	                        (void)xTimerStop(sBtnDblTimer, 0);
	                    } else {
	                        /* 未達長按：處理短按/雙擊 */
	                        if (dbl_pending) {
	                            /* 第二次在時間窗內完成 → 雙擊 */
	                            dbl_pending = false;
	                            (void)xTimerStop(sBtnDblTimer, 0);
	                            PRINTF("[Button] Double Click detected.\r\n");
	                            //PRINTF("[Button] Double Click detected. Sending 0x%02X\r\n",
	                            //      DOUBLE_CLICK_HEX_VALUE);
	                            //uint8_t v = DOUBLE_CLICK_HEX_VALUE;
	                            //(void)xQueueSend(spi_request_queue, &v, 0);
	                        } else {
	                            /* 第一次短按：開窗等第二下 */
	                            dbl_pending = true;
	                            (void)xTimerStop(sBtnDblTimer, 0);
	                            (void)xTimerStart(sBtnDblTimer, 0);
	                        }
	                    }
	                }
	            } // level changed
	        } // EDGE
	    } // for

